railsapp/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
      def find_id_album
        @album = Album.find(params[:id])