railsapp/app/controllers/albums_controller.rb

    def index
      @albums = Album.where("status = ?",'public').order(:created_at)
---
SELECT "albums".* FROM "albums" WHERE (status = 'public') ORDER BY "albums"."created_at" ASC

    def update
      @album = Album.find(params[:id])
      if @album.update(params_update)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "title" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["title", "Cata"], ["updated_at", "2020-08-13 08:31:45.001498"], ["id", 3]]