railsapp/app/controllers/feed_albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY "albums"."created_at" ASC
---
  def index
    @albums = Album.order(:created_at)