railsapp/app/controllers/feed_controller.rb

  def index
    @photo = Photo.order(:created_at)
---
SELECT "photos".* FROM "photos" ORDER BY "photos"."created_at" ASC