railsapp/app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE (status = 'public') ORDER BY "photos"."created_at" ASC LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "photos" WHERE (status = 'public')
---
  def index
    if current_user
      @photo= Photo.joins("INNER JOIN follows ON follows.follower_id = user_id").where("follows.followed_id = :id", id: current_user.id).page params[:page]
      # @photo = Photo.where("status = ?",'1').order(:created_at).includes(:user,:reactions).page params[:page]
    else
      @photo = Photo.where("status = ?",'1').order(:created_at).includes(:user,:reactions).page params[:page]