railsapp/app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["fname", "NGuyễn"], ["lname", "áds"], ["email", "tantai9991@gmail.com"], ["password", "123"], ["created_at", "2020-08-14 09:26:28.160530"], ["updated_at", "2020-08-14 09:26:28.160530"]]
---
  def create
    @user = User.new params_user
    if @user.save